BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/servers.ino
// this file is here just to make development of server files easier, it is not part of any project

#include <WiFi.h>

// #define SHOW_COMPILE_TIME_INFORMATION
#define HOSTNAME                  "MyESP32Server"
#define MACHINETYPE               "ESP32 Dev Modue"
#define DEFAULT_STA_SSID          "YOUR_STA_SSID"
#define DEFAULT_STA_PASSWORD      "YOUR_STA_PASSWORD"
// #define DEFAULT_AP_SSID           HOSTNAME, leave undefined if you don't want to use AP
#define DEFAULT_AP_PASSWORD       "" // "YOUR_AP_PASSWORD"
#define TZ "CET-1CEST,M3.5.0,M10.5.0/3" // default: Europe/Ljubljana or choose another (POSIX) time zone from: https://github.com/nayarsystems/posix_tz_db/blob/master/zones.csv


// uncomment one of the tests at a time
// #define DBG
 #define TEST_DMESG
// #define TEST_FS
 // #define TEST_FTP
// #define TEST_TELNET
// #define TEST_SMTP_CLIENT
// #define TEST_USER_MANAGEMENT
// #define TEST_TIME_FUNCTIONS
// #define TEST_HTTP_SERVER_AND_CLIENT


#ifdef DBG

    #include "tcpConnection.hpp"
    #include "tcpServer.hpp"

    void setup () {
        Serial.begin (115200);
        delay (3000);
        Serial.println ("DBG ...");
    }

    void loop () {

    }

#endif 




#ifdef TEST_DMESG // TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG 

    #include "dmesg.hpp"
    
    void setup () {
        Serial.begin (115200);
        delay (3000);
        Serial.println ("testing ...");

            Serial.printf ("v dmesgQueue je %i elementov\n", dmesgQueue.size ());
            for (int i = 0; i < dmesgQueue.size (); i++) {
                Serial.printf ("   %s\n", dmesgQueue [i].message.c_str ());
            }

        dmesgQueue << "[Test]";
        dmesgQueue << "[Test]" << " there are ";
        dmesgQueue << "[Test] there are " << 0;
        dmesgQueue << "[Test] there are " << 0 << " errors in dmesgQueue";

        dmesgQueue << String ("abc") << String ("def");
        dmesgQueue << Cstring<15> ("ABC") << Cstring<15> ("DEF");
        dmesgQueue << "[the last entry]";

        for (auto e: dmesgQueue) { // use Iterator for scanning the dmesg queue because locking is already implemented here
            Serial.print (e.milliseconds);
            Serial.print (" ");
            Serial.println (e.message);
        }

        for (auto i = dmesgQueue.begin (); i != dmesgQueue.end (); ++ i) {
            Serial.print ((*i).milliseconds);
            Serial.print (" ");
            Serial.println ((*i).message);
        }

    }

    void loop () {
        delay (10000);

        static dmesgQueueEntry_t *lastBack = &dmesgQueue.back ();

        dmesgQueue << "next message";

        if (lastBack != &dmesgQueue.back ()) {
            Serial.println ("-------- dmesgQueue changed --------\n");
            lastBack = &dmesgQueue.back ();

            for (auto e: dmesgQueue) { // use Iterator for scanning the dmesg queue because locking is already implemented here
                Serial.print (e.milliseconds);
                Serial.print (" ");
                Serial.println (e.message);
            }

        }
    }

#endif // TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG TEST_DMESG 





#ifdef TEST_FS // TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS 

    #define SHOW_COMPILE_TIME_INFORMATION 

    // #define FILE_SYSTEM (FILE_SYSTEM_FAT | FILE_SYSTEM_SD_CARD) // FILE_SYSTEM_FAT or FILE_SYSTEM_LITTLEFS optionally bitwise combined with FILE_SYSTEM_SD_CARD
    #define FILE_SYSTEM FILE_SYSTEM_LITTLEFS
    #include "fileSystem.hpp"
    #include "netwk.h"
    #include "telnetServer.hpp"
    #include "ftpServer.hpp"
    #include "httpServer.hpp"

    void setup () {
        Serial.begin (115200);
        while (!Serial)
            delay (100);
        delay (1000);

        // fileSystem.format ();
        // fileSystem.formatFAT ();

        fileSystem.mountLittleFs (true);
        // fileSystem.formatLittleFs ();

        // fileSystem.mountFAT (true); // built-in falsh disk
        // fileSystem.mountSD ("/", 5); // SD Card if attached
    }

    void loop () {
      
    }

#endif // TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS TEST_FS 





#ifdef TEST_FTP // TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP

    // #define SHOW_COMPILE_TIME_INFORMATION

    #define FILE_SYSTEM             FILE_SYSTEM_LITTLEFS
    #define USER_MANAGEMENT         UNIX_LIKE_USER_MANAGEMENT // NO_USER_MANAGEMENT
    #include "dmesg.hpp"
    #include "fileSystem.hpp"
    #include "netwk.h"
    #include "userManagement.hpp"
    #include "ftpServer.hpp"

    ftpServer_t *myFtpServer = NULL;

void setup () {
    Serial.begin (115200);
    delay (3000);

    fileSystem.mountLittleFs (true);
    // fileSystem.formatLittleFs ();

    userManagement.initialize ();

    startWiFi (); // or just call:    WiFi.begin (DEFAULT_STA_SSID, DEFAULT_STA_PASSWORD);

    myFtpServer = new ftpServer_t ();
    if (myFtpServer &&  *myFtpServer) {
        Serial.printf ("FTP server started\n");
    } else {
        Serial.printf ("FTP server did not start\n");
    }

    while (WiFi.localIP ().toString () == "0.0.0.0") { // wait until we get IP from router
        delay (1000); 
        Serial.printf ("   .\n"); 
    } 
    Serial.printf ("Got IP: %s\n", (char *) WiFi.localIP ().toString ().c_str ());
    WiFi.enableIPv6 ();
    delay (100);
}

void loop () {

}

#endif // TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP TEST_FTP 





