BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/servers.ino
#ifdef TEST_TELNET  // TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET 

    // #define FILE_SYSTEM FILE_SYSTEM_LITTLEFS // FILE_SYSTEM_FAT or FILE_SYSTEM_LITTLEFS optionally bitwise combined with FILE_SYSTEM_SD_CARD: (FILE_SYSTEM_FAT | FILE_SYSTEM_SD_CARD) 
 
    #define USE_mDNS
    // #include "std/locale.hpp"
    #include "std/console.hpp"
    #include "dmesg.hpp"
    #include "fileSystem.hpp"
    #include "netwk.h"
    #include "time_functions.h"
    // #include "httpClient.h"
    // #include "smtpClient.h"
    #define USER_MANAGEMENT   NO_USER_MANAGEMENT // NO_USER_MANAGEMENT // UNIX_LIKE_USER_MANAGEMENT // HARDCODED_USER_MANAGEMENT
    #include "userManagement.hpp"
    #include "telnetServer.hpp"


    #if CONFIG_IDF_TARGET_ESP32
        #define MACHINETYPE             "ESP32"   
    #elif CONFIG_IDF_TARGET_ESP32S2
        #define MACHINETYPE             "ESP32-S2"    
        #define MODEST_ESP32_MODEL      // consideration must be taken not to put too much burden on such ESP32
    #elif CONFIG_IDF_TARGET_ESP32S3
        #define MACHINETYPE             "ESP32-S3"
    #elif CONFIG_IDF_TARGET_ESP32C3
        #define MACHINETYPE             "ESP32-C3"        
    #elif CONFIG_IDF_TARGET_ESP32C6
        #define MACHINETYPE             "ESP32-C6"
    #elif CONFIG_IDF_TARGET_ESP32H2
        #define MACHINETYPE             "ESP32-H2"
    #else
        #define MACHINETYPE             "ESP32 (other)"
    #endif


    String telnetCommandHandlerCallback (int argc, char *argv [], telnetServer_t::telnetConnection_t *tcn) {

        #define argv0is(X) (argc > 0 && !strcmp (argv[0], X))  
        #define argv1is(X) (argc > 1 && !strcmp (argv[1], X))
        #define argv2is(X) (argc > 2 && !strcmp (argv[2], X))    
        #ifndef LED_BUILTIN
            #define LED_BUILTIN 2
        #endif
        
        if (argv0is ("led") && argv1is ("state")) {                             // led state telnet command
                return "Led is " + String (digitalRead (LED_BUILTIN) ? "on." : "off.");
        } else if (argv0is ("turn") && argv1is ("led") && argv2is ("on")) {     // turn led on telnet command
                digitalWrite (LED_BUILTIN, HIGH);
                return "Led is on.";
        } else if (argv0is ("turn") && argv1is ("led") && argv2is ("off")) {    // turn led off telnet command
                digitalWrite (LED_BUILTIN, LOW);
                return "Led is off.";
        }

        // let the Telnet server handle command itself
        return "";
    }

    // bool firewall (char *connectingclientIP, char*serverIP) { return true; }

    telnetServer_t *myTelnetServer = NULL; 

    telnetServer_t *myTelnetServerWithSharedListenerTask = NULL; 

    void setup () {
        cinit (true); // true = wait for Serial

        fileSystem.mountLittleFs (true);
        // fileSystem.formatLittleFs ();
        // fileSystem.mountSD ("/SD", 5);
        // fileSystem.mountSD ("/", 5);

        userManagement.initialize ();

        // fileSystem.deleteFile ("/etc/wpa_supplicant/wpa_supplicant.conf"); // STA-tic credentials
        startWiFi ();

        cronDaemon.start (NULL);

        // start fully multitasked telnet server on port 23
        myTelnetServer = new telnetServer_t (telnetCommandHandlerCallback);
        if (myTelnetServer && *myTelnetServer) // check if server instance creation succeded && the server is running as it should
            cout << "Telnet server is running on port 23 :)\n";
        else
            cout << "Telnet server is not running on port 23   :(\n";

        // start telnet server with shared listening tsak (to save some memory that the listener task would use) on port 24
        myTelnetServerWithSharedListenerTask = new telnetServer_t (telnetCommandHandlerCallback, 24, NULL, false);
        if (myTelnetServerWithSharedListenerTask && *myTelnetServerWithSharedListenerTask) // check if server instance creation succeded
            cout << "Telnet server is running on port 24:)\n";
        else
            cout << "Telnet server is not running on port 24   :(\n";

        // setlocale (lc_all, "sl_SI.UTF-8");

        while (WiFi.localIP ().toString () == "0.0.0.0") { 
            delay (1000); 
            Serial.printf ("   .\n"); 
        } // wait until we get IP address from the router

        Serial.println ("--- setup finished ---");
    }

    void loop () {
        // if telnet server doesn't have its own listener task call accept in loop periodically
        if (myTelnetServerWithSharedListenerTask)
            myTelnetServerWithSharedListenerTask->accept (); // listener is using setup-loop task instead of its own
    }

#endif // TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET TEST_TELNET 





#ifdef TEST_SMTP_CLIENT // TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT 

  #include "fileSystem.hpp"
  #include "netwk.h"
  #include "smtpClient.h"
  
  void setup () {
    Serial.begin (115200);

    fileSystem.mountLittleFs (false);
    startWiFi (); // for some strange reason you can't set time if WiFi is not initialized

    while (WiFi.localIP ().toString () == "0.0.0.0") { delay (1000); Serial.printf ("   .\n"); } // wait until we get IP from router
    Serial.printf ("Got IP: %s\n", (char *) WiFi.localIP ().toString ().c_str ());
    delay (100);
    
    Serial.printf ("sendMail (...) = %s\n", sendMail ("<html><p style='color:green;'><b>Success!</b></p></html>", "smtpClient test 1", "bojan.***@***.com,sabina.***@***.com", "\"smtpClient\"<bojan.***@***.net>", "***", "***", 25, "smtp.siol.net"));

    Serial.printf ("sendMail (...) = %s\n", sendMail ("<html><p style='color:blue;'><b>Success!</b></p></html>", "smtpClient test 2", "bojan.***@***.com"));
  }

  void loop () {

