BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/servers.ino
  }

#endif // TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT TEST_SMTP_CLIENT





#ifdef TEST_USER_MANAGEMENT // TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT 

  #define USER_MANAGEMENT UNIX_LIKE_USER_MANAGEMENT // UNIX_LIKE_USER_MANAGEMENT // HARDCODED_USER_MANAGEMENT // NO_USER_MANAGEMENT  

  #include "fileSystem.hpp"
  #include "userManagement.hpp"
  
  void setup () {
    Serial.begin (115200);

    fileSystem.mountLittleFs (false);
    userManagement.initialize ();

    Serial.printf ("checkUserNameAndPassword (root, rootpassword) = %i\n", userManagement.checkUserNameAndPassword ((char *) "root", (char *) "rootpassword"));
    char s [FILE_PATH_MAX_LENGTH + 1];
    userManagement.getHomeDirectory (s, sizeof (s), (char *) "root");
    Serial.print ("getUserHomeDirectory (root) = ");  Serial.println (s);  

    Serial.printf ("userAdd (bojan, 1123, /home/bojan) = %s\n", userManagement.userAdd ((char *) "bojan", (char *) "1123", (char *) "/home/bojan"));
    Serial.printf ("userDel (bojan) = %s\n", userManagement.userDel ((char *) "bojan"));
  }

  void loop () {

  }

#endif // TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENT TEST_USER_MANAGEMENTTEST_USER_MANAGEMENT





#ifdef TEST_TIME_FUNCTIONS // TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS

    #define FILE_SYSTEM FILE_SYSTEM_LITTLEFS 

    #define TIMEZONE "CET-1CEST,M3.5.0,M10.5.0/3" // Europe/Ljubljana, all time zones: https://github.com/nayarsystems/posix_tz_db/blob/master/zones.csv

    #include "fileSystem.hpp" // include fileSystem.hpp if you want cronDaemon to access /etc/ntp.conf and /etc/crontab
    #include "netwk.h"
    #include "time_functions.h"


    void cronHandler (char *cronCommand) {
      
        #define cronCommandIs(X) (!strcmp (cronCommand, X))  

        if (cronCommandIs ("gotTime")) { // triggers only once - when ESP32 reads time from NTP servers for the first time

            char buf [27]; // 26 bytes are needed
            ascTime (localTime (time ()), buf, sizeof (buf));

            Serial.printf ("%s (%s) Got time at %s (local time), ESP32 has been running %lu seconds. Do whatever needs to be done the first time the time is known.\r\n", __func__, cronCommand, buf, getUptime ());

            struct tm afterOneMinute = localTime (time () + 60); // 1 min = 60 s
            char s [100];
            sprintf (s, "%i %i %i * * * afterOneMinute", afterOneMinute.tm_sec, afterOneMinute.tm_min, afterOneMinute.tm_hour);
            if (cronTabAdd (s)) Serial.printf ("--- afterOneMinute --- added\n"); else Serial.printf ("--- afterOneMinute --- NOT added\n"); // change cronTab from within cronHandler
            return;
        } 

        if (cronCommandIs ("afterOneMinute")) { 
            Serial.printf ("ESP32 has been running %lu seconds. Do whatever needs to be done one minute after the time is known.\r\n", getUptime ());
            if (cronTabDel ((char *) "afterOneMinute")) Serial.printf ("--- afterOneMinute --- deleted\n"); else Serial.printf ("--- afterOneMinute --- NOT deleted\n"); // change cronTab from within cronHandler
            return;
        }

        if (cronCommandIs ("onMinute")) { // triggers each minute
            Serial.printf ("|  %6u  ", ESP.getFreeHeap ());
            Serial.printf ("|  %6u  %6u  %6u", heap_caps_get_free_size (MALLOC_CAP_8BIT), heap_caps_get_minimum_free_size (MALLOC_CAP_8BIT), heap_caps_get_largest_free_block (MALLOC_CAP_8BIT));
            Serial.printf ("|  %6u  %6u  %6u", heap_caps_get_free_size (MALLOC_CAP_32BIT), heap_caps_get_minimum_free_size (MALLOC_CAP_32BIT), heap_caps_get_largest_free_block (MALLOC_CAP_32BIT));
            Serial.printf ("|  %6u  %6u  %6u", heap_caps_get_free_size (MALLOC_CAP_DEFAULT), heap_caps_get_minimum_free_size (MALLOC_CAP_DEFAULT), heap_caps_get_largest_free_block (MALLOC_CAP_DEFAULT));
            Serial.printf ("|  %6u  %6u  %6u|\n", heap_caps_get_free_size (MALLOC_CAP_EXEC), heap_caps_get_minimum_free_size (MALLOC_CAP_EXEC), heap_caps_get_largest_free_block (MALLOC_CAP_EXEC));
            return;
        }

        return;
    }
    

    void setup () {
        Serial.begin (115200);
        // while (!Serial) delay (100);
        delay (3000);

        // set time zone
        setenv ("TZ", TIMEZONE, 1); 
        tzset ();

        
        // fileSystem.mount (false);
        // startWiFi (); 
        WiFi.mode (WIFI_STA);
        // WiFi.begin (DEFAULT_STA_SSID, DEFAULT_STA_PASSWORD);
        // while (WiFi.localIP ().toString () == "0.0.0.0") { Serial.println ("."); delay (1000); }

            Serial.println ("--- Time set to 1708387200 = 2024/20/02 00:00:00 - GMT");
            // setTimeOfDay (1708387200); // 2024/20/02 00:00:00 - GMT
                  ntpDate (  "1.si.pool.ntp.org"  );

            char buf [27]; 
            Serial.println ("--- GMT");
              Serial.println (time ());
              ascTime (gmTime (time ()), buf, sizeof (buf)); 
              Serial.println (buf);
            Serial.println ("--- Local");
            struct tm slt = localTime (time ());
            ascTime (slt, buf, sizeof (buf)); 
            Serial.println (buf);

        // startCronDaemon (cronHandler);
        // cronTabAdd ((char *) "* * * * * * gotTime"); 
        // cronTabAdd ((char *) "0 * * * * * onMinute"); 

        // Serial.printf ("|free heap| 8 bit free  min  max   |32 bit free  min  max   |default free  min  max  |exec free   min   max   |\n");
        // Serial.printf ("---------------------------------------------------------------------------------------------------------------\n");    

    }

    void loop () {

