BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/servers.ino
    }

#endif // TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS TEST_TIME_FUNCTIONS



#ifdef TEST_HTTP_SERVER_AND_CLIENT // TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT 

    // #define SHOW_COMPILE_TIME_INFORMATION

    #if CONFIG_IDF_TARGET_ESP32
        #define MACHINETYPE             "ESP32"   
    #elif CONFIG_IDF_TARGET_ESP32S2
        #define MACHINETYPE             "ESP32-S2"    
        #define MODEST_ESP32_MODEL      // consideration must be taken not to put too much burden on such ESP32
    #elif CONFIG_IDF_TARGET_ESP32S3
        #define MACHINETYPE             "ESP32-S3"
    #elif CONFIG_IDF_TARGET_ESP32C3
        #define MACHINETYPE             "ESP32-C3"        
    #elif CONFIG_IDF_TARGET_ESP32C6
        #define MACHINETYPE             "ESP32-C6"
        #define MODEST_ESP32_MODEL // care must be taken not to put too much burden on ESP32-C6 
    #elif CONFIG_IDF_TARGET_ESP32H2
        #define MACHINETYPE             "ESP32-H2"
    #else
        #define MACHINETYPE             "ESP32 (other)"
    #endif


  // #define FILE_SYSTEM (FILE_SYSTEM_FAT | FILE_SYSTEM_SD_CARD) // FILE_SYSTEM_FAT or FILE_SYSTEM_LITTLEFS optionally bitwise combined with FILE_SYSTEM_SD_CARD
  #define FILE_SYSTEM FILE_SYSTEM_LITTLEFS 

  // #define WEB_SESSIONS
  // #define USE_mDNS

  //#include "dmesg.hpp"
  #include "fileSystem.hpp" // include fileSystem.hpp if you want httpServer to server .html and other files as well
  #include "netwk.h"
  // #define USE_WEB_SESSIONS
  #include "httpServer.hpp"
  #include "httpClient.h"
  #include "oscilloscope.h"

  httpServer_t *myHttpServer = NULL;
  httpServer_t *myHttpServerWithSharedListenerTask = NULL; 

  String httpRequestHandlerCallback (char *httpRequest, httpServer_t::httpConnection_t *hcn) { 
    // input: char *httpRequest: the whole HTTP request but without ending \r\n\r\n
    // input example: GET / HTTP/1.1
    //                Host: 192.168.0.168
    //                User-Agent: curl/7.55.1
    //                Accept: */*
    // output: String: content part of HTTP reply, the header will be added by HTTP server before sending it to the client (browser)
    // output example: <html>
    //                   Congratulations, this is working.
    //                 </html>
    // must be reentrant, many httpRequestHandler may run simultaneously in different threads (tasks)
    // don't put anything on the heap (malloc, new, String, ...) for longer time, this would fragment ESP32's memmory

    // DEBUG: Serial.printf ("socket: %i    %s\n", hcn->socket (), httpRequest);

    #define httpRequestStartsWith(X) (strstr(httpRequest,X)==httpRequest)

    if (httpRequestStartsWith ("GET / ")) {
                                            // play with cookies
                                            cstring s = hcn->getHttpRequestCookie ((char *) "refreshCount");
                                            Serial.printf ("This page has been refreshed %s times\n", s);
                                            hcn->setHttpReplyCookie ("refreshCount", cstring (atoi (s) + 1));
                                            // return large HTML reply from memory (9 KB in this case)
                                            return F("<html>\n"
                                                     "  <head>\n"
                                                     "    <meta http-equiv='content-type' content='text/html;charset=utf-8' />\n"
                                                     "\n" 
                                                     "    <title>Test</title>\n"
                                                     "\n" 
                                                     "    <style>\n"
                                                     "\n"
                                                     "      hr {border: 0; border-top: 1px solid lightgray; border-bottom: 1px solid lightgray}\n"
                                                     "\n" 
                                                     "      h1 {font-family: verdana; font-size: 40px; text-align: center}\n"
                                                     "\n" 
                                                     "\n"
                                                     "      div.d1 {position: relative; width: 100%; height: 40px; font-family: verdana; font-size: 30px; color: #2597f4;}\n"
                                                     "      div.d2 {position: relative; float: left; width: 50%; font-family: verdana; font-size: 30px; color: gray;}\n"
                                                     "      div.d3 {position: relative; float: left; width: 50%; font-family: verdana; font-size: 30px; color: black;}\n"
                                                     "\n" 
                                                     "    </style>\n"
                                                     "  </head>\n"
                                                     "   <body>\n"
                                                     "\n"     
                                                     "     <br><h1><small>Test of capabilities</small></h1>\n"
                                                     "     <div class='d1'>\n"
                                                     "       <b>HTML/REST/JSON <small>bi-directional communication with ESP32</small></b>\n"
                                                     "     </div>\n"
                                                     "     <hr />\n"
                                                     "     <div class='d1'>\n"
                                                     "       <div class='d2'>&nbspUp time <small></small></div>\n"
                                                     "       <div class='d3' id='upTime'>...</div>\n"
                                                     "     </div>\n"
                                                     "     <hr />\n"
                                                     "\n" 
                                                     "     <br><br>\n"
                                                     "     <div class='d1'>\n"
                                                     "       <b>HTML/WebSocket <small>data streaming</small></b>\n"
                                                     "     </div>\n"
                                                     "     <hr />\n"
                                                     "     <div class='d1'>\n"
                                                     "       <div class='d2'>&nbspRSSI <small></small></div>\n"
                                                     "       <div class='d3' id='rssi'>...</div>\n"
                                                     "     </div>\n"
                                                     "     <hr />\n"
                                                     "\n" 
                                                     "     <script type='text/javascript'>\n"
                                                     "       var httpClient=function(){\n"
                                                     "         this.request=function(url,method,callback){\n"
                                                     "          var httpRequest=new XMLHttpRequest();\n"
                                                     "          httpRequest.onreadystatechange=function(){\n"
                                                     "               if (httpRequest.readyState==4 && httpRequest.status==200) callback(httpRequest.responseText);\n"
                                                     "          }\n"
                                                     "          httpRequest.open(method,url,true);\n"
                                                     "          httpRequest.send(null);\n"
                                                     "         }\n"
                                                     "       }\n"
                                                     "       var client=new httpClient();\n"
                                                     "\n" 
                                                     "       function refreshUpTime(json){ // refresh up time with latest information from ESP\n"
                                                     "         document.getElementById('upTime').innerText=(JSON.parse(json).upTime) + ' s';\n"
                                                     "       }\n"
                                                     "       setInterval(function(){\n"
                                                     "         client.request('/upTime','GET',function(json){refreshUpTime(json);});\n"
                                                     "       }, 1000);\n"
                                                     "\n" 
                                                     "       // WebSocket streaming:\n"
                                                     "\n" 
                                                     "       if ('WebSocket' in window) {\n"
                                                     "         var ws = new WebSocket ('ws://' + self.location.host + '/rssiReader'); // open webSocket connection\n"
                                                     "         ws.onopen = function () {;};\n"
                                                     "         ws.onmessage = function (evt) {\n" 
                                                     "           if (evt.data instanceof Blob) { // RSSI readings as 1 byte binary data\n"
                                                     "             // receive binary data as blob and then convert it into array\n"
                                                     "             var myByteArray = null;\n"
                                                     "             var myArrayBuffer = null;\n"
                                                     "             var myFileReader = new FileReader ();\n"
                                                     "             myFileReader.onload = function (event) {\n"
                                                     "               myArrayBuffer = event.target.result;\n"
                                                     "               myByteArray = new Int8Array (myArrayBuffer); // <= RSSI information is now in the array of size 1\n"
                                                     "               document.getElementById('rssi').innerText = myByteArray [0].toString () + ' dBm';\n"
                                                     "             };\n"
                                                     "             myFileReader.readAsArrayBuffer (evt.data);\n"
                                                     "           }\n"
                                                     "         };\n"
                                                     "       } else {\n"
                                                     "         alert ('WebSockets are not supported by your browser.');\n"
                                                     "       }\n"
                                                     "\n" 
                                                     "    </script>\n"
                                                     "  </body>\n"
                                                     "</html>\n");
                                          }

    // return small calculated JSON replyes to REST requests
    if (httpRequestStartsWith ("GET /upTime ")) return "{\"upTime\":\"" + String (millis () / 1000) + "\"}";

    // let the HTTP server try to find a file and send it as a reply
    return "";
  }

            void example10_webSockets (httpServer_t::webSocket_t *webSck) {
              while (true) {
                switch (webSck->peek ())        {
                  case 0:                         delay (1); // not ready
                                                  break;
                  case 1:       { // text received STRING_FRAME_TYPE
                                                  cstring s;
                                                  webSck->recvString ((char *) s, s.max_size ()); //// bbb if
                                                  cout << "[example 10] got text from browser over webSocket: " << s << endl;
                                                  break;
                                                }
                  case 2:       { // binary data received BINARY_FRAME_TYPE
                                                  byte buffer [256];
                                                  int bytesRead = webSck->recvBlock (buffer, sizeof (buffer)); 

                                                  cout << "[example 10] got " << bytesRead << " bytes of binary data from browser over webSocket\n";
                                                  // note that we don't really know anything about format of binary data we have got, we'll just assume here it is array of 16 bit integers
                                                  // (I know they are 16 bit integers because I have written javascript client example myself but this information can not be obtained from webSocket)
                                                  int16_t *i = (int16_t *) buffer;
                                                  while ((byte *) (i + 1) <= buffer + bytesRead) 
                                                      cout << *i ++;
                                                  cout << "[example 10] if the sequence is -21 13 -8 5 -3 2 -1 1 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657\n"
                                                          "             it means that both, endianness and complements are compatible with javascript client.\n";
                                                  // send text data
                                                  if (!webSck->sendString ("Thank you webSocket client, I'm sending back 8 32 bit binary floats.")) goto errorInCommunication;
            
                                                  // send binary data
                                                  float geometricSequence [8] = {1.0}; for (int i = 1; i < 8; i++) geometricSequence [i] = geometricSequence [i - 1] / 2;
                                                  if (!webSck->sendBlock ((byte *) geometricSequence, sizeof (geometricSequence))) goto errorInCommunication;
                                                                   
                                                  break; // this is where webSocket connection ends - in our simple "protocol" browser closes the connection but it could be the server as well ...
                                                         // ... just "return;" in this case (instead of break;)
                                                }
                  default: // WebSocket::ERROR, WebSocket::CLOSE, WebSocket::TIME_OUT
            errorInCommunication:     
                                                cout << "[example 10] closing WebSocket\n";
                                                return; // close this connection
                }
              }
            }

  void wsRequestHandlerCallback (char *httpRequest, httpServer_t::webSocket_t *webSck) { 
    // input: char *wsRequest: the whole HTTP request but without ending \r\n\r\n
    // input example: GET /rssiReader HTTP/1.1
    //                Host: 10.18.1.200
    //                Connection: Upgrade
    //                Pragma: no-cache
    //                Cache-Control: no-cache
    //                User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.110 Safari/537.36
    //                Upgrade: websocket
    //                Origin: http://10.18.1.200
    //                Sec-WebSocket-Version: 13
    //                Accept-Encoding: gzip, deflate
    //                Accept-Language: sl-SI,sl;q=0.9,en-GB;q=0.8,en;q=0.7
    //                Sec-WebSocket-Key: mvODNT/nBotKV+3U6LGVIw==
    //                Sec-WebSocket-Extensions: permessage-deflate; client_max_window_bits
    // must be reentrant, many wsRequestHandler may run simultaneously in different threads (tasks)
    // don't put anything on the heap (malloc, new, String, ...) for longer time, this would fragment ESP32's memmory

    #define httpRequestStartsWith(X) (strstr(httpRequest,X)==httpRequest)

    if (httpRequestStartsWith ("GET /rssiReader"))  { // data streaming 
                                                        char c;
                                                        do {
                                                            delay (100);
                                                            int i = WiFi.RSSI ();
                                                            c = (char) i;
                                                        } while (webSck->sendBlock (&c,  sizeof (c))); // send RSSI information as long as web browser is willing to receive it
                                                    }
    else if (httpRequestStartsWith ("GET /example10_WebSockets")) example10_webSockets (webSck); // used by example10.html
  }


  bool firewall (char *clientIP, char *serverIP) { return true; }
    
  void setup () {
    cinit (true); // true = wait for Serial

