BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/servers.ino
    fileSystem.mountLittleFs (true);

    startWiFi ();

    ///myHttpServer = new httpServer_t (httpRequestHandlerCallback, wsRequestHandlerCallback, 80, firewall);
    if (myHttpServer && *myHttpServer) {
        cout << "HTTP server is running on port 80   :)\n";
    } else {
        cout << "HTTP server is not running on port 80   :(\n";
    }

    // start HTTP server with shared listening tsak (to save some memory that the listener task would use) on port 81
    myHttpServerWithSharedListenerTask = new httpServer_t (httpRequestHandlerCallback, wsRequestHandlerCallback, 81, NULL, false);
    if (myHttpServerWithSharedListenerTask && *myHttpServerWithSharedListenerTask) // check if server instance creation succeded
        cout << "HTTP server is running on port 81   :)\n";
    else
        cout << "HTTP server is not running on port 81   :(\n";



        while (WiFi.localIP ().toString () == "0.0.0.0") { 
            delay (1000); 
            Serial.printf ("   .\n"); 
        } // wait until we get IP address from the router
    }

  void loop () {
        // if telnet server doesn't have its own listener task call accept in loop periodically
        if (myHttpServerWithSharedListenerTask)
            myHttpServerWithSharedListenerTask->accept (); // listener is using setup-loop task instead of its own
  }

#endif // TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT TEST_HTTP_SERVER_AND_CLIENT
